_posts/2016-08-16-gamma-kab.html
---
layout: page
title: K(a,b)
date: 2016-08-16
category: gamma
permalink: gamma/k-ab
---

<p>
Here's how the factor \(K(\alpha,\beta)\) and the probability density function \(f^T_{\alpha, \beta}(x)\) of the truncated gamma distribution are computed<br  />
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">from</span> scipy.special <span style="color: #859900;">import</span> gamma
<span style="color: #859900;">import</span> scipy.integrate <span style="color: #859900;">as</span> integrate
<span style="color: #859900;">import</span> numpy <span style="color: #859900;">as</span> np


<span style="color: #859900;">def</span> <span style="color: #268bd2;">K</span>(a,b):

    <span style="color: #b58900;">int_f_0_1</span> = integrate.quad(
        <span style="color: #859900;">lambda</span> x: 1/(b**a*gamma(a))*x**(a-1)*np.exp(-x/b),0,1)
    <span style="color: #b58900;">K_ab</span> = 1./(int_f_0_1[0])

    <span style="color: #859900;">return</span> K_ab


<span style="color: #859900;">def</span> <span style="color: #268bd2;">fT</span>(x,a,b):
    <span style="color: #2aa198;">'''</span>
<span style="color: #2aa198;">    computes the probability density function $f^T_{\alpha, \beta}$ </span>
<span style="color: #2aa198;">    of the truncated gamma distribution $\Gamma^{T}(\alpha,\beta)$</span>
<span style="color: #2aa198;">    '''</span>

    <span style="color: #859900;">if</span> x &lt; 0:
        <span style="color: #b58900;">fT_ab</span> = 0
    <span style="color: #859900;">elif</span> x&gt;1:
        <span style="color: #b58900;">fT_ab</span> = 0
    <span style="color: #859900;">else</span>:
        <span style="color: #b58900;">K_ab</span> = K(a,b)

        <span style="color: #b58900;">fT_ab</span> = K_ab * 1/(b**a*gamma(a))*x**(a-1)*np.exp(-x/b)

    <span style="color: #859900;">return</span> fT_ab
</pre>
</div>


<p>
This script is used as <code>gamma_functions.py</code> in the subsequent calculations and plots for the network with gamma distributed connection probabilities.<br  />
</p>
